In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range("20220101",periods=6)
data = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))

In [3]:
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
data

                   A         B         C         D
2022-01-01 -0.688052  0.305117  1.032439 -1.571952
2022-01-02 -0.052171 -0.502199 -0.390396  0.121777
2022-01-03  1.256141  0.917191  0.455598 -0.699822
2022-01-04 -0.469640 -0.518754  0.808942 -0.576702
2022-01-05  0.514314  1.045907  0.046357 -0.553516
2022-01-06  0.127284 -0.552157 -0.839526  0.498637

In [5]:
data["A"]

2022-01-01   -0.688052
2022-01-02   -0.052171
2022-01-03    1.256141
2022-01-04   -0.469640
2022-01-05    0.514314
2022-01-06    0.127284
Freq: D, Name: A, dtype: float64

In [6]:
data.A

2022-01-01   -0.688052
2022-01-02   -0.052171
2022-01-03    1.256141
2022-01-04   -0.469640
2022-01-05    0.514314
2022-01-06    0.127284
Freq: D, Name: A, dtype: float64

In [7]:
data[data["A"]>0]

                   A         B         C         D
2022-01-03  1.256141  0.917191  0.455598 -0.699822
2022-01-05  0.514314  1.045907  0.046357 -0.553516
2022-01-06  0.127284 -0.552157 -0.839526  0.498637

In [8]:
data["A"]>0

2022-01-01    False
2022-01-02    False
2022-01-03     True
2022-01-04    False
2022-01-05     True
2022-01-06     True
Freq: D, Name: A, dtype: bool

In [9]:
df = data.copy()
df["E"] = [1,2,3,4,5,6]
df

                   A         B         C         D  E
2022-01-01 -0.688052  0.305117  1.032439 -1.571952  1
2022-01-02 -0.052171 -0.502199 -0.390396  0.121777  2
2022-01-03  1.256141  0.917191  0.455598 -0.699822  3
2022-01-04 -0.469640 -0.518754  0.808942 -0.576702  4
2022-01-05  0.514314  1.045907  0.046357 -0.553516  5
2022-01-06  0.127284 -0.552157 -0.839526  0.498637  6

In [10]:
df[df>0]

                   A         B         C         D  E
2022-01-01       NaN  0.305117  1.032439       NaN  1
2022-01-02       NaN       NaN       NaN  0.121777  2
2022-01-03  1.256141  0.917191  0.455598       NaN  3
2022-01-04       NaN       NaN  0.808942       NaN  4
2022-01-05  0.514314  1.045907  0.046357       NaN  5
2022-01-06  0.127284       NaN       NaN  0.498637  6

In [11]:
df>0

                A      B      C      D     E
2022-01-01  False   True   True  False  True
2022-01-02  False  False  False   True  True
2022-01-03   True   True   True  False  True
2022-01-04  False  False   True  False  True
2022-01-05   True   True   True  False  True
2022-01-06   True  False  False   True  True

In [12]:
data

                   A         B         C         D
2022-01-01 -0.688052  0.305117  1.032439 -1.571952
2022-01-02 -0.052171 -0.502199 -0.390396  0.121777
2022-01-03  1.256141  0.917191  0.455598 -0.699822
2022-01-04 -0.469640 -0.518754  0.808942 -0.576702
2022-01-05  0.514314  1.045907  0.046357 -0.553516
2022-01-06  0.127284 -0.552157 -0.839526  0.498637

In [13]:
data.mean()

A    0.114646
B    0.115851
C    0.185569
D   -0.463596
dtype: float64

In [14]:
data.mean(1)

2022-01-01   -0.230612
2022-01-02   -0.205747
2022-01-03    0.482277
2022-01-04   -0.189039
2022-01-05    0.263266
2022-01-06   -0.191440
Freq: D, dtype: float64

In [15]:
df2 = pd.Series(["BWM","Audi","Mercedes Benz","Volkwagen","Kia","TATA","Mahindra"],name = "Cars")
df2.isin(["Audi","TATA"])

0    False
1     True
2    False
3    False
4    False
5     True
6    False
Name: Cars, dtype: bool

In [16]:
~df2.isin(["Audi","TATA"])

0     True
1    False
2     True
3     True
4     True
5    False
6     True
Name: Cars, dtype: bool

In [17]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s
# 1-> [NaN,1,3,5,np.nan,6]
# 2-> [NaN,NaN,1,3,5,np.nan]

2022-01-01    NaN
2022-01-02    NaN
2022-01-03    1.0
2022-01-04    3.0
2022-01-05    5.0
2022-01-06    NaN
Freq: D, dtype: float64

In [18]:
data.sub(s,axis="index")

                   A         B         C         D
2022-01-01       NaN       NaN       NaN       NaN
2022-01-02       NaN       NaN       NaN       NaN
2022-01-03  0.256141 -0.082809 -0.544402 -1.699822
2022-01-04 -3.469640 -3.518754 -2.191058 -3.576702
2022-01-05 -4.485686 -3.954093 -4.953643 -5.553516
2022-01-06       NaN       NaN       NaN       NaN

In [19]:
s1 = pd.Series(["a","b"])
s2 = pd.Series(["c","d"])
pd.concat([s1,s2],ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [20]:
pd.concat([s1,s2],keys=["s1","s2"])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [21]:
pd.concat([s1,s2],keys=["s1","s2"],names=["Series name","Row ID"])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [22]:
df1 = pd.DataFrame([["a",1],["b",2]],columns = ["letter","number"])
df1

  letter  number
0      a       1
1      b       2

In [23]:
df2 = pd.DataFrame([["c",3,"cats"],["d",4,"dogs"]],columns = ["letter","number","animal"])
df2

  letter  number animal
0      c       3   cats
1      d       4   dogs

In [24]:
pd.concat([df1,df2])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3   cats
1      d       4   dogs

In [26]:
pd.concat([df1,df2],sort=False,ignore_index=True)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
2      c       3   cats
3      d       4   dogs